[Survived] ConditionalExpression
src/components/Navbar.jsx:29:26
             <Nav.Link 
               as={Link} 
               to="/" 
-              className={location.pathname === '/' ? 'active' : ''}
+              className={true ? 'active' : ''}
             >
               Home

[Survived] ConditionalExpression
src/components/Navbar.jsx:29:26
             <Nav.Link 
               as={Link} 
               to="/" 
-              className={location.pathname === '/' ? 'active' : ''}
+              className={false ? 'active' : ''}
             >
               Home

[Survived] ConditionalExpression
src/components/Navbar.jsx:37:26
             <NavDropdown 
               title="Serviços" 
               id="basic-nav-dropdown"
-              className={location.pathname.includes('/desenvolvimento-web') || 
-                        location.pathname.includes('/aplicacoes-mobile') || 
-                        location.pathname.includes('/sistemas-empresariais') || 
-                        location.pathname.includes('/consultoria-ti') ? 'active' : ''}
+              className={false ? 'active' : ''}
             >
               <NavDropdown.Item 

[Survived] ConditionalExpression
src/components/Navbar.jsx:37:26
             <NavDropdown 
               title="Serviços" 
               id="basic-nav-dropdown"
-              className={location.pathname.includes('/desenvolvimento-web') || 
-                        location.pathname.includes('/aplicacoes-mobile') || 
-                        location.pathname.includes('/sistemas-empresariais') || 
+              className={false || 
                         location.pathname.includes('/consultoria-ti') ? 'active' : ''}
             >

[NoCoverage] StringLiteral
src/components/Navbar.jsx:40:73
               className={location.pathname.includes('/desenvolvimento-web') || 
                         location.pathname.includes('/aplicacoes-mobile') || 
                         location.pathname.includes('/sistemas-empresariais') || 
-                        location.pathname.includes('/consultoria-ti') ? 'active' : ''}
+                        location.pathname.includes('/consultoria-ti') ? "" : ''}
             >
               <NavDropdown.Item 

[Survived] ConditionalExpression
src/components/Navbar.jsx:45:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/desenvolvimento-web"
-                className={location.pathname === '/desenvolvimento-web' ? 'active' : ''}
+                className={false ? 'active' : ''}
               >
                 💻 Desenvolvimento Web

[Survived] ConditionalExpression
src/components/Navbar.jsx:45:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/desenvolvimento-web"
-                className={location.pathname === '/desenvolvimento-web' ? 'active' : ''}
+                className={true ? 'active' : ''}
               >
                 💻 Desenvolvimento Web

[Survived] ConditionalExpression
src/components/Navbar.jsx:52:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/aplicacoes-mobile"
-                className={location.pathname === '/aplicacoes-mobile' ? 'active' : ''}
+                className={false ? 'active' : ''}
               >
                 📱 Aplicações Mobile

[Survived] ConditionalExpression
src/components/Navbar.jsx:52:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/aplicacoes-mobile"
-                className={location.pathname === '/aplicacoes-mobile' ? 'active' : ''}
+                className={true ? 'active' : ''}
               >
                 📱 Aplicações Mobile

[Survived] ConditionalExpression
src/components/Navbar.jsx:59:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/sistemas-empresariais"
-                className={location.pathname === '/sistemas-empresariais' ? 'active' : ''}
+                className={true ? 'active' : ''}
               >
                 ⚡ Sistemas Empresariais

[Survived] ConditionalExpression
src/components/Navbar.jsx:59:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/sistemas-empresariais"
-                className={location.pathname === '/sistemas-empresariais' ? 'active' : ''}
+                className={false ? 'active' : ''}
               >
                 ⚡ Sistemas Empresariais

[Survived] ConditionalExpression
src/components/Navbar.jsx:66:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/consultoria-ti"
-                className={location.pathname === '/consultoria-ti' ? 'active' : ''}
+                className={false ? 'active' : ''}
               >
                 🏢 Consultoria em TI

[Survived] EqualityOperator
src/components/Navbar.jsx:66:28
               <NavDropdown.Item 
                 as={Link} 
                 to="/consultoria-ti"
-                className={location.pathname === '/consultoria-ti' ? 'active' : ''}
+                className={location.pathname !== '/consultoria-ti' ? 'active' : ''}
               >
                 🏢 Consultoria em TI

[Survived] ConditionalExpression
src/components/Navbar.jsx:75:26
             <Nav.Link 
               as={Link} 
               to="/sobre" 
-              className={location.pathname === '/sobre' ? 'active' : ''}
+              className={true ? 'active' : ''}
             >
               Sobre

[Survived] ConditionalExpression
src/components/Navbar.jsx:75:26
             <Nav.Link 
               as={Link} 
               to="/sobre" 
-              className={location.pathname === '/sobre' ? 'active' : ''}
+              className={false ? 'active' : ''}
             >
               Sobre

[Survived] ConditionalExpression
src/components/Navbar.jsx:82:26
             <Nav.Link 
               as={Link} 
               to="/contato" 
-              className={location.pathname === '/contato' ? 'active' : ''}
+              className={true ? 'active' : ''}
             >
               Contato

[Survived] EqualityOperator
src/components/Navbar.jsx:82:26
             <Nav.Link 
               as={Link} 
               to="/contato" 
-              className={location.pathname === '/contato' ? 'active' : ''}
+              className={location.pathname !== '/contato' ? 'active' : ''}
             >
               Contato
