[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:7:62
 
 function AplicacoesMobile() {
   const tecnologias = [
-    "React Native", "Flutter", "Swift", "Kotlin", "Xamarin", "Ionic", 
+    "React Native", "Flutter", "Swift", "Kotlin", "Xamarin", "", 
     "Firebase", "AWS Mobile", "Google Play Console", "App Store Connect",
     "Redux", "MobX", "GraphQL", "REST API", "Push Notifications"

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:7:21
 
 function AplicacoesMobile() {
   const tecnologias = [
-    "React Native", "Flutter", "Swift", "Kotlin", "Xamarin", "Ionic", 
+    "React Native", "", "Swift", "Kotlin", "Xamarin", "Ionic", 
     "Firebase", "AWS Mobile", "Google Play Console", "App Store Connect",
     "Redux", "MobX", "GraphQL", "REST API", "Push Notifications"

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:8:17
 function AplicacoesMobile() {
   const tecnologias = [
     "React Native", "Flutter", "Swift", "Kotlin", "Xamarin", "Ionic", 
-    "Firebase", "AWS Mobile", "Google Play Console", "App Store Connect",
+    "Firebase", "", "Google Play Console", "App Store Connect",
     "Redux", "MobX", "GraphQL", "REST API", "Push Notifications"
   ];

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:8:31
 function AplicacoesMobile() {
   const tecnologias = [
     "React Native", "Flutter", "Swift", "Kotlin", "Xamarin", "Ionic", 
-    "Firebase", "AWS Mobile", "Google Play Console", "App Store Connect",
+    "Firebase", "AWS Mobile", "", "App Store Connect",
     "Redux", "MobX", "GraphQL", "REST API", "Push Notifications"
   ];

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:9:5
   const tecnologias = [
     "React Native", "Flutter", "Swift", "Kotlin", "Xamarin", "Ionic", 
     "Firebase", "AWS Mobile", "Google Play Console", "App Store Connect",
-    "Redux", "MobX", "GraphQL", "REST API", "Push Notifications"
+    "", "MobX", "GraphQL", "REST API", "Push Notifications"
   ];
 

[NoCoverage] ArrayDeclaration
src/pages/AplicacoesMobile.jsx:12:20
     "Redux", "MobX", "GraphQL", "REST API", "Push Notifications"
   ];
 
-  const projetos = [
-    {
-      title: "App de Delivery",
-      description: "Aplicativo completo de delivery com geolocalização, pagamentos e rastreamento em tempo real.",
-      image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React Native", "Firebase", "Google Maps", "Stripe"]
-    },
-    {
-      title: "App Financeiro",
-      description: "Aplicativo de gestão financeira pessoal com gráficos, relatórios e sincronização em nuvem.",
-      image: "https://images.unsplash.com/photo-1554224155-6726b3ff858f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Flutter", "Dart", "SQLite", "Charts"]
-    },
-    {
-      title: "App Corporativo",
-      description: "Aplicativo interno para colaboradores com acesso a sistemas empresariais e comunicação.",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Swift", "Kotlin", "Azure", "Microsoft Graph"]
-    }
-  ];
+  const projetos = [];
 
   const beneficios = [

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:14:14
 
   const projetos = [
     {
-      title: "App de Delivery",
+      title: "",
       description: "Aplicativo completo de delivery com geolocalização, pagamentos e rastreamento em tempo real.",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:16:14
     {
       title: "App de Delivery",
       description: "Aplicativo completo de delivery com geolocalização, pagamentos e rastreamento em tempo real.",
-      image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: ["React Native", "Firebase", "Google Maps", "Stripe"]
     },

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:17:49
       title: "App de Delivery",
       description: "Aplicativo completo de delivery com geolocalização, pagamentos e rastreamento em tempo real.",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React Native", "Firebase", "Google Maps", "Stripe"]
+      tecnologias: ["React Native", "Firebase", "", "Stripe"]
     },
     {

[NoCoverage] ArrayDeclaration
src/pages/AplicacoesMobile.jsx:17:20
       title: "App de Delivery",
       description: "Aplicativo completo de delivery com geolocalização, pagamentos e rastreamento em tempo real.",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React Native", "Firebase", "Google Maps", "Stripe"]
+      tecnologias: []
     },
     {

[NoCoverage] ObjectLiteral
src/pages/AplicacoesMobile.jsx:19:5
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
       tecnologias: ["React Native", "Firebase", "Google Maps", "Stripe"]
     },
-    {
-      title: "App Financeiro",
-      description: "Aplicativo de gestão financeira pessoal com gráficos, relatórios e sincronização em nuvem.",
-      image: "https://images.unsplash.com/photo-1554224155-6726b3ff858f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Flutter", "Dart", "SQLite", "Charts"]
-    },
+    {},
     {
       title: "App Corporativo",

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:23:50
       title: "App Financeiro",
       description: "Aplicativo de gestão financeira pessoal com gráficos, relatórios e sincronização em nuvem.",
       image: "https://images.unsplash.com/photo-1554224155-6726b3ff858f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Flutter", "Dart", "SQLite", "Charts"]
+      tecnologias: ["Flutter", "Dart", "SQLite", ""]
     },
     {

[NoCoverage] ArrayDeclaration
src/pages/AplicacoesMobile.jsx:23:20
       title: "App Financeiro",
       description: "Aplicativo de gestão financeira pessoal com gráficos, relatórios e sincronização em nuvem.",
       image: "https://images.unsplash.com/photo-1554224155-6726b3ff858f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Flutter", "Dart", "SQLite", "Charts"]
+      tecnologias: []
     },
     {

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:28:14
     {
       title: "App Corporativo",
       description: "Aplicativo interno para colaboradores com acesso a sistemas empresariais e comunicação.",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: ["Swift", "Kotlin", "Azure", "Microsoft Graph"]
     }

[NoCoverage] ArrayDeclaration
src/pages/AplicacoesMobile.jsx:33:22
     }
   ];
 
-  const beneficios = [
-    {
-      icon: "📱",
-      title: "Nativo e Híbrido",
-      description: "Desenvolvimento nativo para performance máxima ou híbrido para economia"
-    },
-    {
-      icon: "🚀",
-      title: "Performance Otimizada",
-      description: "Apps rápidos e fluidos com otimização para cada plataforma"
-    },
-    {
-      icon: "🔒",
-      title: "Segurança Avançada",
-      description: "Implementação de criptografia e autenticação biométrica"
-    },
-    {
-      icon: "📊",
-      title: "Analytics Integrado",
-      description: "Monitoramento completo do uso e performance dos apps"
-    }
-  ];
+  const beneficios = [];
 
   return (

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:35:13
 
   const beneficios = [
     {
-      icon: "📱",
+      icon: ""
       title: "Nativo e Híbrido",
       description: "Desenvolvimento nativo para performance máxima ou híbrido para economia"

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:41:14
     },
     {
       icon: "🚀",
-      title: "Performance Otimizada",
+      title: "",
       description: "Apps rápidos e fluidos com otimização para cada plataforma"
     },

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:42:20
     {
       icon: "🚀",
       title: "Performance Otimizada",
-      description: "Apps rápidos e fluidos com otimização para cada plataforma"
+      description: ""
     },
     {

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:45:13
       description: "Apps rápidos e fluidos com otimização para cada plataforma"
     },
     {
-      icon: "🔒",
+      icon: ""
       title: "Segurança Avançada",
       description: "Implementação de criptografia e autenticação biométrica"

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:46:14
     },
     {
       icon: "🔒",
-      title: "Segurança Avançada",
+      title: "",
       description: "Implementação de criptografia e autenticação biométrica"
     },

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:47:20
     {
       icon: "🔒",
       title: "Segurança Avançada",
-      description: "Implementação de criptografia e autenticação biométrica"
+      description: ""
     },
     {

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:51:14
     },
     {
       icon: "📊",
-      title: "Analytics Integrado",
+      title: "",
       description: "Monitoramento completo do uso e performance dos apps"
     }

[NoCoverage] StringLiteral
src/pages/AplicacoesMobile.jsx:52:20
     {
       icon: "📊",
       title: "Analytics Integrado",
-      description: "Monitoramento completo do uso e performance dos apps"
+      description: ""
     }
   ];

[NoCoverage] ArrowFunction
src/pages/AplicacoesMobile.jsx:84:32
           <Col>
             <h2 className="text-center mb-4">Tecnologias Mobile</h2>
             <div className="tecnologias-grid">
-              {tecnologias.map((tech, index) => (
-                <Badge key={index} bg="info" className="me-2 mb-2 fs-6">
-                  {tech}
-                </Badge>
-              ))}
+              {tecnologias.map(() => undefined)}
             </div>
           </Col>

[NoCoverage] ArrowFunction
src/pages/AplicacoesMobile.jsx:98:31
           <Col>
             <h2 className="text-center mb-4">Vantagens dos nossos apps mobile</h2>
             <Row className="g-4">
-              {beneficios.map((beneficio, index) => (
-                <Col key={index} md={6} lg={3}>
-                  <Card className="h-100 text-center beneficio-card">
-                    <Card.Body>
-                      <div className="beneficio-icon mb-3">{beneficio.icon}</div>
-                      <h4 className="h5 mb-3">{beneficio.title}</h4>
-                      <p className="text-muted">{beneficio.description}</p>
-                    </Card.Body>
-                  </Card>
-                </Col>
-              ))}
+              {beneficios.map(() => undefined)}
             </Row>
           </Col>

[NoCoverage] ArrowFunction
src/pages/AplicacoesMobile.jsx:118:29
           <Col>
             <h2 className="text-center mb-4">Apps em Destaque</h2>
             <Row className="g-4">
-              {projetos.map((projeto, index) => (
-                <Col key={index} lg={4}>
-                  <Card className="h-100 projeto-card">
-                    <div className="projeto-image-container">
-                      <img 
-                        src={projeto.image} 
-                        alt={projeto.title}
-                        className="projeto-image"
-                      />
-                    </div>
-                    <Card.Body className="d-flex flex-column">
-                      <h4 className="h5 mb-3">{projeto.title}</h4>
-                      <p className="text-muted mb-3 flex-grow-1">{projeto.description}</p>
-                      <div className="projeto-technologies">
-                        {projeto.tecnologias.map((tech, techIndex) => (
-                          <Badge key={techIndex} bg="secondary" className="me-1 mb-1">
-                            {tech}
-                          </Badge>
-                        ))}
-                      </div>
-                    </Card.Body>
-                  </Card>
-                </Col>
-              ))}
+              {projetos.map(() => undefined)}
             </Row>
           </Col>

[NoCoverage] ArrowFunction
src/pages/AplicacoesMobile.jsx:132:50
                       <h4 className="h5 mb-3">{projeto.title}</h4>
                       <p className="text-muted mb-3 flex-grow-1">{projeto.description}</p>
                       <div className="projeto-technologies">
-                        {projeto.tecnologias.map((tech, techIndex) => (
-                          <Badge key={techIndex} bg="secondary" className="me-1 mb-1">
-                            {tech}
-                          </Badge>
-                        ))}
+                        {projeto.tecnologias.map(() => undefined)}
                       </div>
                     </Card.Body>
