[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:7:46
 
 function ConsultoriaTI() {
   const tecnologias = [
-    "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
+    "Arquitetura", "DevOps", "Cloud", "AWS", "", "Google Cloud", 
     "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
     "Microservices", "API Gateway", "Service Mesh", "Monitoring", 

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:7:39
 
 function ConsultoriaTI() {
   const tecnologias = [
-    "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
+    "Arquitetura", "DevOps", "Cloud", "", "Azure", "Google Cloud", 
     "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
     "Microservices", "API Gateway", "Service Mesh", "Monitoring", 

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:8:40
 function ConsultoriaTI() {
   const tecnologias = [
     "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
-    "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
+    "Docker", "Kubernetes", "Jenkins", "", "Terraform", 
     "Microservices", "API Gateway", "Service Mesh", "Monitoring", 
     "Logging", "Security", "Compliance", "Performance"

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:8:53
 function ConsultoriaTI() {
   const tecnologias = [
     "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
-    "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
+    "Docker", "Kubernetes", "Jenkins", "GitLab CI", "", 
     "Microservices", "API Gateway", "Service Mesh", "Monitoring", 
     "Logging", "Security", "Compliance", "Performance"

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:9:37
   const tecnologias = [
     "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
     "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
-    "Microservices", "API Gateway", "Service Mesh", "Monitoring", 
+    "Microservices", "API Gateway", "", "Monitoring", 
     "Logging", "Security", "Compliance", "Performance"
   ];

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:9:53
   const tecnologias = [
     "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
     "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
-    "Microservices", "API Gateway", "Service Mesh", "Monitoring", 
+    "Microservices", "API Gateway", "Service Mesh", "", 
     "Logging", "Security", "Compliance", "Performance"
   ];

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:10:28
     "Arquitetura", "DevOps", "Cloud", "AWS", "Azure", "Google Cloud", 
     "Docker", "Kubernetes", "Jenkins", "GitLab CI", "Terraform", 
     "Microservices", "API Gateway", "Service Mesh", "Monitoring", 
-    "Logging", "Security", "Compliance", "Performance"
+    "Logging", "Security", "", "Performance"
   ];
 

[NoCoverage] ArrayDeclaration
src/pages/ConsultoriaTI.jsx:13:20
     "Logging", "Security", "Compliance", "Performance"
   ];
 
-  const projetos = [
-    {
-      title: "Migração para Cloud",
-      description: "Migração completa de infraestrutura on-premise para AWS com otimização de custos.",
-      image: "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["AWS", "Docker", "Terraform", "Jenkins"]
-    },
-    {
-      title: "Arquitetura de Microserviços",
-      description: "Redesenho de arquitetura monolítica para microserviços com alta disponibilidade.",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Kubernetes", "Docker", "API Gateway", "Monitoring"]
-    },
-    {
-      title: "DevOps Implementation",
-      description: "Implementação completa de pipeline CI/CD com automação de deploy e testes.",
-      image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Jenkins", "GitLab", "Docker", "Kubernetes"]
-    }
-  ];
+  const projetos = [];
 
   const beneficios = [

[NoCoverage] ArrayDeclaration
src/pages/ConsultoriaTI.jsx:18:20
       title: "Migração para Cloud",
       description: "Migração completa de infraestrutura on-premise para AWS com otimização de custos.",
       image: "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["AWS", "Docker", "Terraform", "Jenkins"]
+      tecnologias: []
     },
     {

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:18:38
       title: "Migração para Cloud",
       description: "Migração completa de infraestrutura on-premise para AWS com otimização de custos.",
       image: "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["AWS", "Docker", "Terraform", "Jenkins"]
+      tecnologias: ["AWS", "Docker", "", "Jenkins"]
     },
     {

[NoCoverage] ObjectLiteral
src/pages/ConsultoriaTI.jsx:20:5
       image: "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
       tecnologias: ["AWS", "Docker", "Terraform", "Jenkins"]
     },
-    {
-      title: "Arquitetura de Microserviços",
-      description: "Redesenho de arquitetura monolítica para microserviços com alta disponibilidade.",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Kubernetes", "Docker", "API Gateway", "Monitoring"]
-    },
+    {},
     {
       title: "DevOps Implementation",

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:21:14
       tecnologias: ["AWS", "Docker", "Terraform", "Jenkins"]
     },
     {
-      title: "Arquitetura de Microserviços",
+      title: "",
       description: "Redesenho de arquitetura monolítica para microserviços com alta disponibilidade.",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:24:21
       title: "Arquitetura de Microserviços",
       description: "Redesenho de arquitetura monolítica para microserviços com alta disponibilidade.",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Kubernetes", "Docker", "API Gateway", "Monitoring"]
+      tecnologias: ["", "Docker", "API Gateway", "Monitoring"]
     },
     {

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:24:60
       title: "Arquitetura de Microserviços",
       description: "Redesenho de arquitetura monolítica para microserviços com alta disponibilidade.",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Kubernetes", "Docker", "API Gateway", "Monitoring"]
+      tecnologias: ["Kubernetes", "Docker", "API Gateway", ""]
     },
     {

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:29:14
     {
       title: "DevOps Implementation",
       description: "Implementação completa de pipeline CI/CD com automação de deploy e testes.",
-      image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: ["Jenkins", "GitLab", "Docker", "Kubernetes"]
     }

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:30:42
       title: "DevOps Implementation",
       description: "Implementação completa de pipeline CI/CD com automação de deploy e testes.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Jenkins", "GitLab", "Docker", "Kubernetes"]
+      tecnologias: ["Jenkins", "GitLab", "", "Kubernetes"]
     }
   ];

[NoCoverage] ArrayDeclaration
src/pages/ConsultoriaTI.jsx:30:20
       title: "DevOps Implementation",
       description: "Implementação completa de pipeline CI/CD com automação de deploy e testes.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Jenkins", "GitLab", "Docker", "Kubernetes"]
+      tecnologias: []
     }
   ];

[NoCoverage] ObjectLiteral
src/pages/ConsultoriaTI.jsx:35:5
   ];
 
   const beneficios = [
-    {
-      icon: "🏗️",
-      title: "Arquitetura Robusta",
-      description: "Design de sistemas escaláveis e resilientes"
-    },
+    {},
     {
       icon: "🚀",

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:38:20
     {
       icon: "🏗️",
       title: "Arquitetura Robusta",
-      description: "Design de sistemas escaláveis e resilientes"
+      description: ""
     },
     {

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:43:20
     {
       icon: "🚀",
       title: "DevOps Automatizado",
-      description: "Implementação de pipelines CI/CD completos"
+      description: ""
     },
     {

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:46:13
       description: "Implementação de pipelines CI/CD completos"
     },
     {
-      icon: "☁️",
+      icon: "",
       title: "Cloud Native",
       description: "Migração e otimização para cloud computing"

[NoCoverage] StringLiteral
src/pages/ConsultoriaTI.jsx:53:20
     {
       icon: "🔒",
       title: "Segurança Avançada",
-      description: "Implementação de padrões de segurança corporativa"
+      description: ""
     }
   ];

[NoCoverage] ArrowFunction
src/pages/ConsultoriaTI.jsx:85:32
           <Col>
             <h2 className="text-center mb-4">Áreas de Consultoria</h2>
             <div className="tecnologias-grid">
-              {tecnologias.map((tech, index) => (
-                <Badge key={index} bg="warning" className="me-2 mb-2 fs-6">
-                  {tech}
-                </Badge>
-              ))}
+              {tecnologias.map(() => undefined)}
             </div>
           </Col>
