[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:17:50
 }).required();
 
 function Contato() {
-  const [showSuccess, setShowSuccess] = useState(false);
+  const [showSuccess, setShowSuccess] = useState(true);
   const [isSubmitting, setIsSubmitting] = useState(false);
 

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:18:52
 
 function Contato() {
   const [showSuccess, setShowSuccess] = useState(false);
-  const [isSubmitting, setIsSubmitting] = useState(false);
+  const [isSubmitting, setIsSubmitting] = useState(true);
 
   const {

[NoCoverage] BlockStatement
src/pages/Contato.jsx:29:36
     resolver: yupResolver(schema)
   });
 
-  const onSubmit = async (data) => {
-    setIsSubmitting(true);
-    await new Promise(resolve => setTimeout(resolve, 1000));
-    console.log('Dados do formulário:', data);
-    setShowSuccess(true);
-    setIsSubmitting(false);
-    reset();
-    setTimeout(() => setShowSuccess(false), 3000);
-  };
+  const onSubmit = async (data) => {};
 
   return (

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:30:21
   });
 
   const onSubmit = async (data) => {
-    setIsSubmitting(true);
+    setIsSubmitting(false);
     await new Promise(resolve => setTimeout(resolve, 1000));
     console.log('Dados do formulário:', data);

[NoCoverage] ArrowFunction
src/pages/Contato.jsx:31:23
 
   const onSubmit = async (data) => {
     setIsSubmitting(true);
-    await new Promise(resolve => setTimeout(resolve, 1000));
+    await new Promise(() => undefined);
     console.log('Dados do formulário:', data);
     setShowSuccess(true);

[NoCoverage] StringLiteral
src/pages/Contato.jsx:32:17
   const onSubmit = async (data) => {
     setIsSubmitting(true);
     await new Promise(resolve => setTimeout(resolve, 1000));
-    console.log('Dados do formulário:', data);
+    console.log("", data);
     setShowSuccess(true);
     setIsSubmitting(false);

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:33:20
     setIsSubmitting(true);
     await new Promise(resolve => setTimeout(resolve, 1000));
     console.log('Dados do formulário:', data);
-    setShowSuccess(true);
+    setShowSuccess(false);
     setIsSubmitting(false);
     reset();

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:34:21
     await new Promise(resolve => setTimeout(resolve, 1000));
     console.log('Dados do formulário:', data);
     setShowSuccess(true);
-    setIsSubmitting(false);
+    setIsSubmitting(true);
     reset();
     setTimeout(() => setShowSuccess(false), 3000);

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:36:37
     setShowSuccess(true);
     setIsSubmitting(false);
     reset();
-    setTimeout(() => setShowSuccess(false), 3000);
+    setTimeout(() => setShowSuccess(true), 3000);
   };
 

[NoCoverage] ArrowFunction
src/pages/Contato.jsx:36:16
     setShowSuccess(true);
     setIsSubmitting(false);
     reset();
-    setTimeout(() => setShowSuccess(false), 3000);
+    setTimeout(() => undefined, 3000);
   };
 

[NoCoverage] ArrowFunction
src/pages/Contato.jsx:58:44
                 <h3 className="mb-0">Informações de Contato</h3>
               </Card.Header>
               <Card.Body>
-                {contatoData.infoItems.map((item, index) => (
-                  <div key={index} className="mb-3">
-                    <h5 className="fw-bold">{item.title}</h5>
-                    <p className="text-muted" dangerouslySetInnerHTML={{ __html: item.content }}></p>
-                  </div>
-                ))}
+                {contatoData.infoItems.map(() => undefined)}
               </Card.Body>
             </Card>

[NoCoverage] LogicalOperator
src/pages/Contato.jsx:75:18
                 <h3 className="mb-0">Envie uma Mensagem</h3>
               </Card.Header>
               <Card.Body>
-                {showSuccess && (
-                  <Alert variant="success" dismissible onClose={() => setShowSuccess(false)}>
-                    Mensagem enviada com sucesso!
-                  </Alert>
-                )}
+                {showSuccess || <Alert variant="success" dismissible onClose={() => setShowSuccess(false)}>
+                    Mensagem enviada com sucesso!
+                  </Alert>}
 
                 <Form onSubmit={handleSubmit(onSubmit)}>

[NoCoverage] ConditionalExpression
src/pages/Contato.jsx:75:18
                 <h3 className="mb-0">Envie uma Mensagem</h3>
               </Card.Header>
               <Card.Body>
-                {showSuccess && (
-                  <Alert variant="success" dismissible onClose={() => setShowSuccess(false)}>
-                    Mensagem enviada com sucesso!
-                  </Alert>
-                )}
+                {false}
 
                 <Form onSubmit={handleSubmit(onSubmit)}>

[NoCoverage] ArrowFunction
src/pages/Contato.jsx:76:65
               </Card.Header>
               <Card.Body>
                 {showSuccess && (
-                  <Alert variant="success" dismissible onClose={() => setShowSuccess(false)}>
+                  <Alert variant="success" dismissible onClose={() => undefined}>
                     Mensagem enviada com sucesso!
                   </Alert>

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:76:86
               </Card.Header>
               <Card.Body>
                 {showSuccess && (
-                  <Alert variant="success" dismissible onClose={() => setShowSuccess(false)}>
+                  <Alert variant="success" dismissible onClose={() => setShowSuccess(true)}>
                     Mensagem enviada com sucesso!
                   </Alert>

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:89:39
                         <Form.Control
                           type="text"
                           placeholder="Seu nome"
-                          isInvalid={!!errors.nome}
+                          isInvalid={!errors.nome}
                           {...register('nome')}
                         />

[NoCoverage] OptionalChaining
src/pages/Contato.jsx:93:28
                           {...register('nome')}
                         />
                         <Form.Control.Feedback type="invalid">
-                          {errors.nome?.message}
+                          {errors.nome.message}
                         </Form.Control.Feedback>
                       </Form.Group>

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:103:39
                         <Form.Control
                           type="email"
                           placeholder="seu@email.com"
-                          isInvalid={!!errors.email}
+                          isInvalid={!errors.email}
                           {...register('email')}
                         />

[NoCoverage] StringLiteral
src/pages/Contato.jsx:104:40
                           type="email"
                           placeholder="seu@email.com"
                           isInvalid={!!errors.email}
-                          {...register('email')}
+                          {...register("")}
                         />
                         <Form.Control.Feedback type="invalid">

[NoCoverage] BooleanLiteral
src/pages/Contato.jsx:119:35
                       as="textarea"
                       rows={4}
                       placeholder="Digite sua mensagem..."
-                      isInvalid={!!errors.mensagem}
+                      isInvalid={!errors.mensagem}
                       {...register('mensagem')}
                     />

[NoCoverage] StringLiteral
src/pages/Contato.jsx:120:36
                       rows={4}
                       placeholder="Digite sua mensagem..."
                       isInvalid={!!errors.mensagem}
-                      {...register('mensagem')}
+                      {...register("")}
                     />
                     <Form.Control.Feedback type="invalid">

[NoCoverage] OptionalChaining
src/pages/Contato.jsx:123:24
                       {...register('mensagem')}
                     />
                     <Form.Control.Feedback type="invalid">
-                      {errors.mensagem?.message}
+                      {errors.mensagem.message}
                     </Form.Control.Feedback>
                   </Form.Group>
