[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:7:35
 
 function DesenvolvimentoWeb() {
   const tecnologias = [
-    "React", "Node.js", "Python", "PHP", "Laravel", "Vue.js", "Angular", 
+    "React", "Node.js", "Python", "", "Laravel", "Vue.js", "Angular", 
     "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
     "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:7:42
 
 function DesenvolvimentoWeb() {
   const tecnologias = [
-    "React", "Node.js", "Python", "PHP", "Laravel", "Vue.js", "Angular", 
+    "React", "Node.js", "Python", "PHP", "", "Vue.js", "Angular", 
     "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
     "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:8:58
 function DesenvolvimentoWeb() {
   const tecnologias = [
     "React", "Node.js", "Python", "PHP", "Laravel", "Vue.js", "Angular", 
-    "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
+    "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "", 
     "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"
   ];

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:8:5
 function DesenvolvimentoWeb() {
   const tecnologias = [
     "React", "Node.js", "Python", "PHP", "Laravel", "Vue.js", "Angular", 
-    "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
+    "", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
     "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"
   ];

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:9:67
   const tecnologias = [
     "React", "Node.js", "Python", "PHP", "Laravel", "Vue.js", "Angular", 
     "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
-    "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"
+    "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", ""
   ];
 

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:9:5
   const tecnologias = [
     "React", "Node.js", "Python", "PHP", "Laravel", "Vue.js", "Angular", 
     "TypeScript", "JavaScript", "HTML5", "CSS3", "Sass", "Bootstrap", 
-    "Tailwind CSS", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"
+    "", "Next.js", "Nuxt.js", "Express.js", "Django", "Flask"
   ];
 

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:17:41
       title: "E-commerce Completo",
       description: "Plataforma de vendas online com sistema de pagamentos, gestão de estoque e painel administrativo.",
       image: "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React", "Node.js", "MongoDB", "Stripe"]
+      tecnologias: ["React", "Node.js", "", "Stripe"]
     },
     {

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:22:14
     {
       title: "Sistema de Gestão",
       description: "Aplicação web para gestão empresarial com módulos de RH, financeiro e operacional.",
-      image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: ["Vue.js", "Laravel", "PostgreSQL", "Docker"]
     },

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:23:42
       title: "Sistema de Gestão",
       description: "Aplicação web para gestão empresarial com módulos de RH, financeiro e operacional.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Vue.js", "Laravel", "PostgreSQL", "Docker"]
+      tecnologias: ["Vue.js", "Laravel", "", "Docker"]
     },
     {

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:23:56
       title: "Sistema de Gestão",
       description: "Aplicação web para gestão empresarial com módulos de RH, financeiro e operacional.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Vue.js", "Laravel", "PostgreSQL", "Docker"]
+      tecnologias: ["Vue.js", "Laravel", "PostgreSQL", ""]
     },
     {

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:29:38
       title: "Portal Corporativo",
       description: "Portal interno para colaboradores com intranet, comunicação e ferramentas de trabalho.",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Angular", "C#", ".NET", "SQL Server"]
+      tecnologias: ["Angular", "C#", "", "SQL Server"]
     }
   ];

[NoCoverage] ArrayDeclaration
src/pages/DesenvolvimentoWeb.jsx:33:22
     }
   ];
 
-  const beneficios = [
-    {
-      icon: "🚀",
-      title: "Performance Otimizada",
-      description: "Aplicações rápidas e responsivas com carregamento otimizado"
-    },
-    {
-      icon: "📱",
-      title: "Design Responsivo",
-      description: "Sites que funcionam perfeitamente em todos os dispositivos"
-    },
-    {
-      icon: "🔒",
-      title: "Segurança Avançada",
-      description: "Implementação de melhores práticas de segurança web"
-    },
-    {
-      icon: "⚡",
-      title: "SEO Otimizado",
-      description: "Sites otimizados para motores de busca"
-    }
-  ];
+  const beneficios = [];
 
   return (

[NoCoverage] ObjectLiteral
src/pages/DesenvolvimentoWeb.jsx:34:5
   ];
 
   const beneficios = [
-    {
-      icon: "🚀",
-      title: "Performance Otimizada",
-      description: "Aplicações rápidas e responsivas com carregamento otimizado"
-    },
+    {},
     {
       icon: "📱",

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:37:20
     {
       icon: "🚀",
       title: "Performance Otimizada",
-      description: "Aplicações rápidas e responsivas com carregamento otimizado"
+      description: ""
     },
     {

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:42:20
     {
       icon: "📱",
       title: "Design Responsivo",
-      description: "Sites que funcionam perfeitamente em todos os dispositivos"
+      description: ""
     },
     {

[NoCoverage] ObjectLiteral
src/pages/DesenvolvimentoWeb.jsx:49:5
       title: "Segurança Avançada",
       description: "Implementação de melhores práticas de segurança web"
     },
-    {
-      icon: "⚡",
-      title: "SEO Otimizado",
-      description: "Sites otimizados para motores de busca"
-    }
+    {}
   ];
 

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:50:13
       description: "Implementação de melhores práticas de segurança web"
     },
     {
-      icon: "⚡",
+      icon: "",
       title: "SEO Otimizado",
       description: "Sites otimizados para motores de busca"

[NoCoverage] StringLiteral
src/pages/DesenvolvimentoWeb.jsx:52:20
     {
       icon: "⚡",
       title: "SEO Otimizado",
-      description: "Sites otimizados para motores de busca"
+      description: ""
     }
   ];

[NoCoverage] ArrowFunction
src/pages/DesenvolvimentoWeb.jsx:84:32
           <Col>
             <h2 className="text-center mb-4">Tecnologias que Utilizamos</h2>
             <div className="tecnologias-grid">
-              {tecnologias.map((tech, index) => (
-                <Badge key={index} bg="primary" className="me-2 mb-2 fs-6">
-                  {tech}
-                </Badge>
-              ))}
+              {tecnologias.map(() => undefined)}
             </div>
           </Col>
