[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:7:29
 
 function SistemasEmpresariais() {
   const tecnologias = [
-    "Java", "Spring", "C#", ".NET", "PostgreSQL", "SQL Server", "Oracle", 
+    "Java", "Spring", "C#", "", "PostgreSQL", "SQL Server", "Oracle", 
     "Microservices", "Docker", "Kubernetes", "AWS", "Azure", "Jenkins", 
     "Git", "JUnit", "Selenium", "REST API", "GraphQL", "Message Queues"

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:7:13
 
 function SistemasEmpresariais() {
   const tecnologias = [
-    "Java", "Spring", "C#", ".NET", "PostgreSQL", "SQL Server", "Oracle", 
+    "Java", "", "C#", ".NET", "PostgreSQL", "SQL Server", "Oracle", 
     "Microservices", "Docker", "Kubernetes", "AWS", "Azure", "Jenkins", 
     "Git", "JUnit", "Selenium", "REST API", "GraphQL", "Message Queues"

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:8:46
 function SistemasEmpresariais() {
   const tecnologias = [
     "Java", "Spring", "C#", ".NET", "PostgreSQL", "SQL Server", "Oracle", 
-    "Microservices", "Docker", "Kubernetes", "AWS", "Azure", "Jenkins", 
+    "Microservices", "Docker", "Kubernetes", "", "Azure", "Jenkins", 
     "Git", "JUnit", "Selenium", "REST API", "GraphQL", "Message Queues"
   ];

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:8:5
 function SistemasEmpresariais() {
   const tecnologias = [
     "Java", "Spring", "C#", ".NET", "PostgreSQL", "SQL Server", "Oracle", 
-    "Microservices", "Docker", "Kubernetes", "AWS", "Azure", "Jenkins", 
+    "", "Docker", "Kubernetes", "AWS", "Azure", "Jenkins", 
     "Git", "JUnit", "Selenium", "REST API", "GraphQL", "Message Queues"
   ];

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:9:12
   const tecnologias = [
     "Java", "Spring", "C#", ".NET", "PostgreSQL", "SQL Server", "Oracle", 
     "Microservices", "Docker", "Kubernetes", "AWS", "Azure", "Jenkins", 
-    "Git", "JUnit", "Selenium", "REST API", "GraphQL", "Message Queues"
+    "Git", "", "Selenium", "REST API", "GraphQL", "Message Queues"
   ];
 

[NoCoverage] ArrayDeclaration
src/pages/SistemasEmpresariais.jsx:12:20
     "Git", "JUnit", "Selenium", "REST API", "GraphQL", "Message Queues"
   ];
 
-  const projetos = [
-    {
-      title: "ERP Completo",
-      description: "Sistema integrado de gestão empresarial com módulos financeiro, RH, estoque e vendas.",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Java", "Spring", "PostgreSQL", "Docker"]
-    },
-    {
-      title: "CRM Avançado",
-      description: "Sistema de gestão de relacionamento com clientes com automação de vendas e marketing.",
-      image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: [".NET", "C#", "SQL Server", "Azure"]
-    },
-    {
-      title: "Sistema de Vendas",
-      description: "Plataforma completa de vendas com gestão de leads, orçamentos e comissões.",
-      image: "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Java", "Spring Boot", "MySQL", "Redis"]
-    }
-  ];
+  const projetos = [];
 
   const beneficios = [

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:15:20
   const projetos = [
     {
       title: "ERP Completo",
-      description: "Sistema integrado de gestão empresarial com módulos financeiro, RH, estoque e vendas.",
+      description: "",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
       tecnologias: ["Java", "Spring", "PostgreSQL", "Docker"]

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:17:53
       title: "ERP Completo",
       description: "Sistema integrado de gestão empresarial com módulos financeiro, RH, estoque e vendas.",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Java", "Spring", "PostgreSQL", "Docker"]
+      tecnologias: ["Java", "Spring", "PostgreSQL", ""]
     },
     {

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:17:29
       title: "ERP Completo",
       description: "Sistema integrado de gestão empresarial com módulos financeiro, RH, estoque e vendas.",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Java", "Spring", "PostgreSQL", "Docker"]
+      tecnologias: ["Java", "", "PostgreSQL", "Docker"]
     },
     {

[NoCoverage] ObjectLiteral
src/pages/SistemasEmpresariais.jsx:19:5
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
       tecnologias: ["Java", "Spring", "PostgreSQL", "Docker"]
     },
-    {
-      title: "CRM Avançado",
-      description: "Sistema de gestão de relacionamento com clientes com automação de vendas e marketing.",
-      image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: [".NET", "C#", "SQL Server", "Azure"]
-    },
+    {},
     {
       title: "Sistema de Vendas",

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:20:14
       tecnologias: ["Java", "Spring", "PostgreSQL", "Docker"]
     },
     {
-      title: "CRM Avançado",
+      title: "",
       description: "Sistema de gestão de relacionamento com clientes com automação de vendas e marketing.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:22:14
     {
       title: "CRM Avançado",
       description: "Sistema de gestão de relacionamento com clientes com automação de vendas e marketing.",
-      image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: [".NET", "C#", "SQL Server", "Azure"]
     },

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:23:21
       title: "CRM Avançado",
       description: "Sistema de gestão de relacionamento com clientes com automação de vendas e marketing.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: [".NET", "C#", "SQL Server", "Azure"]
+      tecnologias: ["", "C#", "SQL Server", "Azure"]
     },
     {

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:23:29
       title: "CRM Avançado",
       description: "Sistema de gestão de relacionamento com clientes com automação de vendas e marketing.",
       image: "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: [".NET", "C#", "SQL Server", "Azure"]
+      tecnologias: [".NET", "", "SQL Server", "Azure"]
     },
     {

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:27:20
     },
     {
       title: "Sistema de Vendas",
-      description: "Plataforma completa de vendas com gestão de leads, orçamentos e comissões.",
+      description: "",
       image: "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
       tecnologias: ["Java", "Spring Boot", "MySQL", "Redis"]

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:28:14
     {
       title: "Sistema de Vendas",
       description: "Plataforma completa de vendas com gestão de leads, orçamentos e comissões.",
-      image: "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: ["Java", "Spring Boot", "MySQL", "Redis"]
     }

[NoCoverage] ArrayDeclaration
src/pages/SistemasEmpresariais.jsx:29:20
       title: "Sistema de Vendas",
       description: "Plataforma completa de vendas com gestão de leads, orçamentos e comissões.",
       image: "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Java", "Spring Boot", "MySQL", "Redis"]
+      tecnologias: []
     }
   ];

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:29:53
       title: "Sistema de Vendas",
       description: "Plataforma completa de vendas com gestão de leads, orçamentos e comissões.",
       image: "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["Java", "Spring Boot", "MySQL", "Redis"]
+      tecnologias: ["Java", "Spring Boot", "MySQL", ""]
     }
   ];

[NoCoverage] ObjectLiteral
src/pages/SistemasEmpresariais.jsx:34:5
   ];
 
   const beneficios = [
-    {
-      icon: "⚡",
-      title: "Performance Escalável",
-      description: "Sistemas otimizados para crescer com seu negócio"
-    },
+    {},
     {
       icon: "🔒",

[NoCoverage] ObjectLiteral
src/pages/SistemasEmpresariais.jsx:39:5
       title: "Performance Escalável",
       description: "Sistemas otimizados para crescer com seu negócio"
     },
-    {
-      icon: "🔒",
-      title: "Segurança Empresarial",
-      description: "Implementação de padrões de segurança corporativa"
-    },
+    {},
     {
       icon: "📊",

[NoCoverage] ObjectLiteral
src/pages/SistemasEmpresariais.jsx:44:5
       title: "Segurança Empresarial",
       description: "Implementação de padrões de segurança corporativa"
     },
-    {
-      icon: "📊",
-      title: "Relatórios Avançados",
-      description: "Dashboards e relatórios em tempo real"
-    },
+    {},
     {
       icon: "🔄",

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:46:14
     },
     {
       icon: "📊",
-      title: "Relatórios Avançados",
+      title: "",
       description: "Dashboards e relatórios em tempo real"
     },

[NoCoverage] StringLiteral
src/pages/SistemasEmpresariais.jsx:47:20
     {
       icon: "📊",
       title: "Relatórios Avançados",
-      description: "Dashboards e relatórios em tempo real"
+      description: ""
     },
     {

[NoCoverage] ArrowFunction
src/pages/SistemasEmpresariais.jsx:84:32
           <Col>
             <h2 className="text-center mb-4">Tecnologias Empresariais</h2>
             <div className="tecnologias-grid">
-              {tecnologias.map((tech, index) => (
-                <Badge key={index} bg="success" className="me-2 mb-2 fs-6">
-                  {tech}
-                </Badge>
-              ))}
+              {tecnologias.map(() => undefined)}
             </div>
           </Col>
