[Killed] ObjectLiteral
src/components/Home/BlogNews.jsx:8:5
 function BlogNews() {
   // Dados simulados das últimas notícias do blog
   const blogNews = [
-    {
-      id: 1,
-      title: "Tendências de Desenvolvimento Web em 2024",
-      excerpt: "Descubra as principais tecnologias e frameworks que estão dominando o mercado de desenvolvimento web este ano...",
-      author: "Equipe Nova Código",
-      date: "15 Jan 2024",
-      category: "Tecnologia",
-      readTime: "5 min",
-      image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
-      tags: ["React", "JavaScript", "Web Development"]
-    },
+    {},
     {
       id: 2,
killedBy: Home Page renderiza o título principal
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:12:15
       id: 1,
       title: "Tendências de Desenvolvimento Web em 2024",
       excerpt: "Descubra as principais tecnologias e frameworks que estão dominando o mercado de desenvolvimento web este ano...",
-      author: "Equipe Nova Código",
+      author: "",
       date: "15 Jan 2024",
       category: "Tecnologia",
killedBy: BlogNews Component renderiza informações de autor, data e tempo de leitura
statusReason: Unable to find an element with the text: Equipe Nova Código. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:13:13
       title: "Tendências de Desenvolvimento Web em 2024",
       excerpt: "Descubra as principais tecnologias e frameworks que estão dominando o mercado de desenvolvimento web este ano...",
       author: "Equipe Nova Código",
-      date: "15 Jan 2024",
+      date: "",
       category: "Tecnologia",
       readTime: "5 min",
killedBy: BlogNews Component renderiza informações de autor, data e tempo de leitura
statusReason: Unable to find an element with the text: 15 Jan 2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:14:17
       excerpt: "Descubra as principais tecnologias e frameworks que estão dominando o mercado de desenvolvimento web este ano...",
       author: "Equipe Nova Código",
       date: "15 Jan 2024",
-      category: "Tecnologia",
+      category: "",
       readTime: "5 min",
       image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
killedBy: BlogNews Component renderiza categorias das notícias
statusReason: Unable to find an element with the text: Tecnologia. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Survived] StringLiteral
src/components/Home/BlogNews.jsx:16:14
       date: "15 Jan 2024",
       category: "Tecnologia",
       readTime: "5 min",
-      image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
+      image: "",
       tags: ["React", "JavaScript", "Web Development"]
     },

[Survived] StringLiteral
src/components/Home/BlogNews.jsx:22:16
     {
       id: 2,
       title: "Como Otimizar Performance em Aplicações Mobile",
-      excerpt: "Dicas práticas para melhorar a performance e experiência do usuário em aplicações mobile nativas e híbridas...",
+      excerpt: "",
       author: "Carlos Silva",
       date: "12 Jan 2024",

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:23:15
       id: 2,
       title: "Como Otimizar Performance em Aplicações Mobile",
       excerpt: "Dicas práticas para melhorar a performance e experiência do usuário em aplicações mobile nativas e híbridas...",
-      author: "Carlos Silva",
+      author: "",
       date: "12 Jan 2024",
       category: "Mobile",
killedBy: BlogNews Component renderiza informações de autor, data e tempo de leitura
statusReason: Unable to find an element with the text: Carlos Silva. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Killed] ArrayDeclaration
src/components/Home/BlogNews.jsx:28:13
       category: "Mobile",
       readTime: "7 min",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tags: ["React Native", "Performance", "Mobile"]
+      tags: []
     },
     {
killedBy: BlogNews Component renderiza tags das notícias
statusReason: Unable to find an element with the text: React Native. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:28:30
       category: "Mobile",
       readTime: "7 min",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tags: ["React Native", "Performance", "Mobile"]
+      tags: ["React Native", "", "Mobile"]
     },
     {
killedBy: BlogNews Component renderiza tags das notícias
statusReason: Unable to find an element with the text: Performance. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Survived] StringLiteral
src/components/Home/BlogNews.jsx:33:16
     {
       id: 3,
       title: "Arquitetura de Microserviços: Guia Completo",
-      excerpt: "Entenda os conceitos fundamentais e melhores práticas para implementar microserviços em sua aplicação...",
+      excerpt: "",
       author: "Ana Costa",
       date: "10 Jan 2024",

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:34:15
       id: 3,
       title: "Arquitetura de Microserviços: Guia Completo",
       excerpt: "Entenda os conceitos fundamentais e melhores práticas para implementar microserviços em sua aplicação...",
-      author: "Ana Costa",
+      author: "",
       date: "10 Jan 2024",
       category: "Arquitetura",
killedBy: BlogNews Component renderiza informações de autor, data e tempo de leitura
statusReason: Unable to find an element with the text: Ana Costa. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Survived] StringLiteral
src/components/Home/BlogNews.jsx:38:14
       date: "10 Jan 2024",
       category: "Arquitetura",
       readTime: "10 min",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tags: ["Microserviços", "Docker", "Kubernetes"]
     }

[Killed] StringLiteral
src/components/Home/BlogNews.jsx:39:31
       category: "Arquitetura",
       readTime: "10 min",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tags: ["Microserviços", "Docker", "Kubernetes"]
+      tags: ["Microserviços", "", "Kubernetes"]
     }
   ];
killedBy: BlogNews Component renderiza tags das notícias
statusReason: Unable to find an element with the text: Docker. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >

[Survived] StringLiteral
src/components/Home/BlogNews.jsx:39:41
       category: "Arquitetura",
       readTime: "10 min",
       image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tags: ["Microserviços", "Docker", "Kubernetes"]
+      tags: ["Microserviços", "Docker", ""]
     }
   ];

[Killed] ArrowFunction
src/components/Home/BlogNews.jsx:90:36
                   <p className="text-muted mb-3 flex-grow-1">{news.excerpt}</p>
 
                   <div className="blog-tags mb-3">
-                    {news.tags.map((tag, index) => (
-                      <Badge key={index} bg="light" text="dark" className="me-1">
-                        {tag}
-                      </Badge>
-                    ))}
+                    {news.tags.map(() => undefined)}
                   </div>
 
killedBy: BlogNews Component renderiza tags das notícias
statusReason: Unable to find an element with the text: React. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="blog-news-section"
    >
