[Killed] StringLiteral
src/pages/Home.jsx:11:20
   const servicos = [
     {
       title: "Desenvolvimento Web",
-      description: "Criamos sites responsivos, aplicações web modernas e sistemas complexos com as melhores tecnologias do mercado.",
+      description: "",
       icon: "💻",
       image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
killedBy: Home Page renderiza descrições dos serviços
statusReason: Unable to find an element with the text: /Criamos sites responsivos/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home-page"
    >

[Killed] ArrayDeclaration
src/pages/Home.jsx:14:20
       description: "Criamos sites responsivos, aplicações web modernas e sistemas complexos com as melhores tecnologias do mercado.",
       icon: "💻",
       image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
-      tecnologias: ["React", "Node.js", "Python", "Laravel", "Vue.js"]
+      tecnologias: []
     },
     {
killedBy: Home Page renderiza tecnologias dos serviços
statusReason: Unable to find an element with the text: Node.js. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home-page"
    >

[Survived] StringLiteral
src/pages/Home.jsx:14:51
       description: "Criamos sites responsivos, aplicações web modernas e sistemas complexos com as melhores tecnologias do mercado.",
       icon: "💻",
       image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
-      tecnologias: ["React", "Node.js", "Python", "Laravel", "Vue.js"]
+      tecnologias: ["React", "Node.js", "Python", "", "Vue.js"]
     },
     {

[Killed] ObjectLiteral
src/pages/Home.jsx:16:5
       image: "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&h=400&q=80",
       tecnologias: ["React", "Node.js", "Python", "Laravel", "Vue.js"]
     },
-    {
-      title: "Aplicações Mobile",
-      description: "Desenvolvemos apps nativos e híbridos para iOS e Android com experiência de usuário excepcional.",
-      icon: "📱",
-      image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React Native", "Flutter", "Swift", "Kotlin"]
-    },
+    {},
     {
       title: "Sistemas Empresariais",
killedBy: Home Page renderiza o título principal
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/pages/Home.jsx:21:37
       description: "Desenvolvemos apps nativos e híbridos para iOS e Android com experiência de usuário excepcional.",
       icon: "📱",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React Native", "Flutter", "Swift", "Kotlin"]
+      tecnologias: ["React Native", "", "Swift", "Kotlin"]
     },
     {
killedBy: Home Page renderiza tecnologias dos serviços
statusReason: Unable to find an element with the text: Flutter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home-page"
    >

[Survived] StringLiteral
src/pages/Home.jsx:21:21
       description: "Desenvolvemos apps nativos e híbridos para iOS e Android com experiência de usuário excepcional.",
       icon: "📱",
       image: "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
-      tecnologias: ["React Native", "Flutter", "Swift", "Kotlin"]
+      tecnologias: ["", "Flutter", "Swift", "Kotlin"]
     },
     {

[Survived] StringLiteral
src/pages/Home.jsx:24:14
       tecnologias: ["React Native", "Flutter", "Swift", "Kotlin"]
     },
     {
-      title: "Sistemas Empresariais",
+      title: "",
       description: "Soluções personalizadas para otimizar processos internos e aumentar a eficiência do seu negócio.",
       icon: "⚡",

[Survived] StringLiteral
src/pages/Home.jsx:27:14
       title: "Sistemas Empresariais",
       description: "Soluções personalizadas para otimizar processos internos e aumentar a eficiência do seu negócio.",
       icon: "⚡",
-      image: "https://images.unsplash.com/photo-1551434678-e076c223a692?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
+      image: "",
       tecnologias: ["Java", "Spring", "C#", ".NET", "PostgreSQL"]
     },

[Killed] StringLiteral
src/pages/Home.jsx:32:20
     },
     {
       title: "Consultoria em TI",
-      description: "Análise, arquitetura e planejamento de soluções tecnológicas para impulsionar seu negócio.",
+      description: "",
       icon: "🏢",
       image: "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&h=400&q=80",
killedBy: Home Page renderiza descrições dos serviços
statusReason: Unable to find an element with the text: /Análise, arquitetura/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home-page"
    >

[Survived] ArrowFunction
src/pages/Home.jsx:54:39
               </p>
               <div className="banner-stats mb-4">
                 <Row className="g-3">
-                  {homeData.stats.map((stat, index) => (
-                    <Col key={index} md={3} className="text-center">
-                      <div className="banner-stat">
-                        <h3 className="display-6 fw-bold text-primary mb-1">{stat.value}</h3>
-                        <p className="text-muted mb-0">{stat.label}</p>
-                      </div>
-                    </Col>
-                  ))}
+                  {homeData.stats.map(() => undefined)}
                 </Row>
               </div>

[Killed] ArrowFunction
src/pages/Home.jsx:96:50
                       <h3 className="h4 mb-3">{servico.title}</h3>
                       <p className="text-muted mb-3 flex-grow-1">{servico.description}</p>
                       <div className="service-technologies">
-                        {servico.tecnologias.map((tech, techIndex) => (
-                          <Badge key={techIndex} bg="primary" className="me-1 mb-1">
-                            {tech}
-                          </Badge>
-                        ))}
+                        {servico.tecnologias.map(() => undefined)}
                       </div>
                     </Card.Body>
killedBy: Home Page renderiza tecnologias dos serviços
statusReason: Unable to find an element with the text: Node.js. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home-page"
    >

[Survived] ArrowFunction
src/pages/Home.jsx:113:34
         {/* Features Section */}
         <Row className="g-4 mb-5">
           <h2 className="text-center mb-4">Por que escolher a Nova Código?</h2>
-          {homeData.features.map((feature, index) => (
-            <Col key={index} md={4}>
-              <Card className="h-100 text-center feature-card">
-                <Card.Body>
-                  <div className="feature-icon mb-3">{feature.icon}</div>
-                  <h3 className="h5 mb-3">{feature.title}</h3>
-                  <p className="text-muted">{feature.description}</p>
-                </Card.Body>
-              </Card>
-            </Col>
-          ))}
+          {homeData.features.map(() => undefined)}
         </Row>
 

[Survived] ArrowFunction
src/pages/Home.jsx:129:31
         {/* Stats Section */}
         <Row className="g-4">
           <h2 className="text-center mb-4">Números que Importam</h2>
-          {homeData.stats.map((stat, index) => (
-            <Col key={index} md={3} className="text-center">
-              <div className="stat-item">
-                <h3 className="display-6 fw-bold text-primary">{stat.value}</h3>
-                <p className="text-muted">{stat.label}</p>
-              </div>
-            </Col>
-          ))}
+          {homeData.stats.map(() => undefined)}
         </Row>
       </Container>
